###########################################################################

#        #     #                            #
# #      #     # #                        # #
#  #           #  #                      #  #
#  #     #     #   #                    #   #
# #      #     #    #                  #    #
#        #     #     #                #     #
# #      #     #      #              #      #
#  #     #     #       #            #       #
#   #    #     #        #          #        #
#   #    #     #         #        #         #
#   #    #     #          #      #          #
#  #     #     #           #    #           #
# #      #     #            #  #            #
#        #     #             #              #
 
#                    #                    #                            #
# #                 # #                   # #                        # #
#  #               #   #                  #  #                      #  #
#  #              #     #                 #   #                    #   #
# #              #       #                #    #                  #    #
#               #         #               #     #                #     #
# #            #           #              #      #              #      #
#  #          #             #             #       #            #       #
#   #        #################            #        #          #        #
#   #       #                 #           #         #        #         #
#   #      #                   #          #          #      #          #
#  #      #                     #         #           #    #           #
# #      #                       #        #            #  #            #
#       #                         #       #             #              #

'''this.provod@gmail.com Кулебакин Иван Викторович'''
##########################################################################


import math

def generate_y(k):
    dt = 2 * math.pi / 1000
    L = k / 100
    omega = 1000 / k

    y = [0, (-1)**k * dt]

    for i in range(498):
        r = (i + 2) * dt
        y.append(y[i + 1] * (2 + dt * L * (1 - y[i]**2)) - y[i] * (1 + dt**2 + dt * L * (1 - y[i]**2)) + dt**2 * math.sin(omega * r))
        
    return y

if __name__ == '__main__':
    k = int(input('Введите ваш номер в журнале:\n> '))
    print(f'Сгенерированный ряд:\n{generate_y(k)}')